
% this is a single line comment

% { This is 
... multi line 
... comment

%% عملیات ریاضی ساده
% result = 4*25 + 6*22 + 2*99

%% با استفاده از ;از نمایش خروجی جلوگیری میشود ولی نتیجه در پنجره متغییر ها قابل مشاهده است
% a = 25;
% b = 30;
% result = a + b;
%%  عملگر های ریاضی  \ / , * , - , + , ^
% a = 10;
% b = 2;
% res1 = 10 + 2
% res2 = 10 - 2
% res3 = 10 * 2
% res4 = 10 / 2
% res5 = 10 \ 2
% res6 = 10 ^ 2

%% who whos دستور 
% نمایش متغییر ها

%% clc دستور 
% پاک کردن ترمینال

%% clearvars دستور
% پاک کردن متغییر ها 

%% نام گزاری متغییر ها
% حروف بزرگ و کوچک با هم فرق دارند
% فقط حروف A-Z
% a-z
% 1-9 به شرط اینکه اول حروف نباشند
% _  
% استفاده کنید
% اسمی برای متغییر انتخاب کنید که مشخص کننده وظیفه ان متغییر باشد 

%% توابع ریاضی مهم 
% abs conj log10
% acos exp real
% asin fix imag
% acosh round rem(x,y)
% asinh gcd(x,y) sign
% atan lcm(x,y) sqrt
% atanh log


%% input(prompt)
% num1 = input("Enter a value:");

%% تعریف متغییر
% x = 10; % یک ماتریس یک در یک تعریف می شود
%% تعریف وکتور 
% x = 1:2:10
% y = linspace(1,100)
% z = [1 2 3 4 5 6]
%% تعریف ماتریس 
% X = [1 2 3; 4 5 6; 7 8 9]
%% مثال
% x = 0: 0.1*pi : pi
% y = sin(x)

%% ماتریس های ویژه
% eye یک ماتریس یکه با ابعاد داده شده ایجاد میکند
% zero یک ماتریس صفر با ابعاد داده شده ایجاد میکند.
% ones  یک ماتریس با تمام درایه های یک ب ابعاد داده شده ایجاد میکند
% rand یک ماتریس با درایه های رنده با ابعاد داده شده ایجاد میکند

%% مثال 
% ones(5,5)
%%
% ضریب یک ماتریس در یک ماتریس باید تعداد سطر های ماتریس اول با تعداد ستون های ماتریس دو م
% و تعداد ستون های ماتریس اول با تعداد سطر های ماتریس دوم برابر باشد

% x = [1 2; 3 4]
% 
% y =x*x

%%  در غیر این صورت باگ ایجاد می شود
% x = [1 2; 3 4; 5 6]
% y = x*x
%% اگر میخواهیم عملیات برای هر درایه به درایه اتفاق بیفتد از . استفاده میکنیم
%  x = [1 2; 3 4; 5 6]
%  y = x.*x

%% برای دسترسی به یک درایه یا تعدای از درایه های یک ماتریس
% x = [1 2; 3 4; 5 6]
% x(1,2) % سطر اول ستون دوم
% x(5) % به صورت یک شماره از ستون اول رو به پایین می شماریم 
% x(1:2, 1:2) % از سطر اول تا دوم از ستون اول تا دوم

%%  ادیت کردن یک درایه یا مجموعه ای از درایه ها
% x = [1 2; 3 4; 5 6]
% x(1,2) = 10;
% x(5) = 8;
% x(1:2, 1:2) = [9 8; 7 8]

%% عملگر های شرطی
% < , > , <= , >= , == , ~=
% 10 > 5
% 5 <= 6
% 5 ~= 9

%% عملگر های and , or, not
% 10 > 5 & 5 >6
% 10> 5 | 5 >6
% ~(10>5)
%% if elseif else  دستور
% برای چک کردن یک شرط استفاده میشود
% x = 10
% if x > 5
%     disp("x > 5");
% elseif x > 2
%     disp ("x>2")
% else
%     disp("test")
% end

%% Switch case  دستور
% x = 10
% switch x 
%     case 1 
%         dis("1")
%     case 5
%         disp("5")
%     otherwise
%         disp("10")
% end

%% for loop  دستور
% for c = 1:10
%     if c == 2
%         continue % از روی عدد دو می پریم
%     elseif c == 5
%             break %  وقتی به 5 رسیدیم حلقه قطع شود
%     else
%         disp(c)
%     end
% end

%% while loop دستور
%  n = 10
%  while n > 0
%      disp(n)
%      n = n-1
%  end